#include<cstdio>
#include<vector>
using namespace std;
int main()
{
    vector<int> v[105];
    int a,s,d,f;
    scanf("%d",&a);
    while(a--)
    {
        scanf("%d",&s);
        if(s==1)
        {
            scanf("%d%d",&d,&f);
            v[d].push_back(f);
        }
        else if(s==2)
        {
            scanf("%d%d",&d,&f);
            for(int q=0;q<f;q++)
            {
                if(!v[d].empty())
                v[d].pop_back();
            }
        }
        else
        {
            scanf("%d%d",&d,&f);
            printf("%d\n",v[d][f]);
        }
    }
}

/**************************************************************
1134: 好玩木塊第二版
時間限制: 5 Sec  記憶體限制: 128 MB

題目描述
圈圈喜歡玩木塊疊疊樂，而且會疊很多疊，每個木塊都有個編號，在玩的過程中他主要會做三件事情

1.      在第k堆木塊堆，往上疊木塊

2.      從第k堆木塊上方，拿走a個木塊

3.      看看第 K堆的第n個木塊是甚麼

輸入
對於每組測資，輸入的第一行有一個正整數n(n<=1000000)，代表有n個操作

對於每個操作，分三種：

1 k a: 在第k堆木塊堆上方，放上編號為a的積木

2 k a: 在第k堆木塊堆的上方，取走a個

3 k a: 詢問第k堆木塊堆的第a個木塊是甚麼編號(最下方的木塊為第0個)

0<=a<=109, 0<=n<106, 0<=k<100

輸出
對於每次詢問，輸出積木編號

輸入範例
9
1 0 6
1 0 2
1 2 2
1 1 5
1 0 3
3 0 1
2 0 2
1 0 9
3 0 1
輸出範例
2
9
提示
請用printf加快輸出，printf的格式如下


printf("%d\n,a); //等同於cout<<a<<endl; a為整數



對於範例輸入，木塊堆的變化如下


1 0 6 => {6}


1 0 2 => {6,2}


1 2 2 => {6,2},{},{2}


1 1 5 => {6,2},{5},{2}


1 0 3 => {6,2,3},{5},{2}


3 0 1 => 2


2 0 2 => {6},{5},{2}


1 0 9 => {6,9},{5},{2}


3 0 1 => 9


****************************************************************/

/**************************************************************
    Problem: 1134
    User: max2124
    Language: C++
    Result: Accepted
    Time:388 ms
    Memory:7216 kb
****************************************************************/

